[{"DRUG NAME": "Viagra", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["25mg", "50mg", "100mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "28 tablets", "32 tablets", "64 tablets"], "UUID": "707b3289", "PRICE": "£16.99", "REVIEWS": "4.7", "INFORMATION": ["Viagra is the most well-known treatment for adult men with erectile dysfunction, sometimes known as impotence. This is when a man cannot get, or keep a hard, erect penis suitable for sexual activity. Viagra pills have been used to treat erectile dysfunction for over two decades and been proven to be very effective for more than 80% of men.", "When you take Viagra pills you may be able to:", "Sildenafil (also known as sildenafil citrate) is the generic version of the Viagra licensed since 2013 in the UK.", "Sildenafil citrate is the active ingredient in Viagra and is available in a generic, unbranded tablet. Sildenafil and Viagra are medically equivalent but Sildenafil is available at a much lower cost.", "Generic medicines contain the same active ingredient and are equally effective and medically equivalent as the branded products but are available at a lower price. Generic manufacturers have to demonstrate that they are medically identical to the branded product - i.e. they offer the same quality, strength, stability and effectiveness.", "Generic medicines are required meet the same standards of safety, quality and efficacy as the branded medication. To receive market approval from the European Medicines Agency and MHRA, a generic medicine must be 'bioequivalent' to the originator product.", "(read more about viagra vs sildenafil)", "Viagra Connect is an over the counter medicine licensed by Pfizer which is identical to Viagra. The medicine is available without prescription from pharmacies but the patient must complete a questionnaire which the pharmacist will check before dispensing.", "How can order Viagra? – if you would like to order Viagra online, licensed online pharmacy services like MedExpress are the safest option. Our prescribers at MedExpress will review your respones to our medical questionnaire and ensure the medicine is appropriate for you. If the medication is appropriate, we will send the medicine to you in discreet packaging.", "Find a registered online pharmacy – there are many websites from which you can buy Viagra. However, many of them are neither legimate UK licensed online pharmacies, which means taking the medicines they sell could be dangerous. Before buying any medicine online, you should always check whether the company you are using has been approved by the General Pharmaceutical Council. You should also pay attention to the fact Viagra is prescription-only medication and any website selling it without the involvement of a UK licensed prescriber is not safe.", "The recommended starting dose for Viagra (sildenafil) is one 50mg pill taken 1 hour before sexual activity. If you achieve the desired effect but are suffering from side effects, try lowering the dose to 25mg. If after trying 50mg pills four times without the desired effect, and you are not experiencing side effects, increase the dose to 100mg. If after trying 100mg 8 separate times without effect you should cease treatment and consult your doctor. You should not take Viagra (sildenafil) more than once a day as this will have not increase the effectiveness and may increase the likelihood of experiencing side effects.", "You should take Viagra (Sildenafil) about one hour before you plan to have sex. Swallow the tablet whole with a glass of water.", "Viagra (Sildenafil) can be taken with or without food. However, you may find that Viagra (Sildenafil) takes longer to start working if you take it with a heavy meal.", "Viagra belongs to a class of medication known as PDE5 inhibitors. In the presence of sexual stimulation, PDE5 inhibitors such as Viagra relax smooth muscle and increase blood flow to the penis, helping to restore impaired erectile function.", "Viagra will stay in the body on average 4 hours after dosing. For some men it may remain as long as 5 hours, or a few as 3 hours.", "Viagra is generally well tolerated and comes in a variety of dosages so the strength can easily be decreased for men experiencing bothersome side effects. The most common side effects include headache, flushing, indigestion, nasal congestion, dizziness, nausea, hot flush and visual disturbances. These common side effects are all transient in nature and should not last more than a few hours. Studies have not shown any effect on sperm motility or morphology.", "Find out more:Side Effects of Viagra"], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/viagra"}, {"DRUG NAME": "Sildenafil (Generic Viagra)", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["25mg", "50mg", "100mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "28 tablets", "32 tablets", "64 tablets"], "UUID": "d8a4315d", "PRICE": "£16.99", "REVIEWS": "4.7", "INFORMATION": ["Sildenafil citrate is the generic version of the Viagra, the most well known treatment for erectile dysfunction (ED).", "Sildenafil is the active ingredient in Viagra and is available in a generic, unbranded tablet. Sildenafil and Viagra are medically equivalent but Sildenafil is available at a much lower cost.", "Generic medicines contain the same active ingredient and are equally effective and medically equivalent as the branded products but are available at a lower price. Generic manufacturers have to demonstrate that they are medically identical to the branded product - i.e. they offer the same quality, strength, stability and effectiveness.", "Visit our Generic Medicine FAQ for more information.", "The recommended starting dose for sildenafil is one 50mg tablet taken 1 hour before sexual activity. If you achieve the desired effect but are suffering from side effects, try lowering the dose to 25mg. If after trying 50mg tablets four times without the desired effect, and you are not experiencing side effects, increase the dose to 100mg. If after trying 100mg 8 separate times without effect you should cease treatment and consult your doctor. You should not take sildenafil more than once a day as this will have not increase the effectiveness and may increase the likelihood of experiencing side effects.", "You should take Sildenafil about one hour before you plan to have sex. Swallow the tablet whole with a glass of water.", "Sildenafil can be taken with or without food. However, you may find that Sildenafil takes longer to start working if you take it with a heavy meal.", "As Sildenafil is a generic drug it is produced by several manufacturers, which helps to lower the price. Viagra is produced only by Pfizer who set the price. The two products are medically identical but because of the brand name of Viagra the product sells at a substantial premium."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/generic-sildenafil"}, {"DRUG NAME": "Cialis (Tadalafil)", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["2.5mg", "5mg", "10mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "28 tablets", "32 tablets", "64 tablets"], "UUID": "5ae0d9e8", "PRICE": "£19.99", "REVIEWS": "4.7", "INFORMATION": ["Cialis contains the active ingredient tadalafil and is a medication used to treat erectile dysfunction. It offers particularly long lasting effects in comparison to the other treatment options available and can produce results for up to 36 hours after taking a single pill in helping you to get and keep an erection.", "Tadalafil is the generic version of the Cialis, one of the most popular erectile dysfunction treatments.", "Tadalafil is the name of the active ingredient in Cialis and is a medication used to treat erectile dysfunction. It offers particularly long lasting effects in comparison to the other treatment options available and can produce results for up to 36 hours after taking a single pill in helping you to get and keep an erection.", "Tadalafil is the active ingredient in Cialis and is available in a generic, unbranded tablet. Tadalafil and Cialis are medically equivalent but Tadalafil is available at a much lower cost.", "Generic medicines contain the same active ingredient and are equally effective and medically equivalent as the branded products but are available at a lower price. Generic manufacturers have to demonstrate that they are medically identical to the branded product - i.e. they offer the same quality, strength, stability and effectiveness.", "(read more about Cialis vs Tadalafil)", "Cialis 36-Hour and Cialis Daily both contain the same medication but have different purposes and are there for taken differently.", "How to take Cialis 36 Hour:", "Take 1 tablet whole with a glass of water 30 minutes to 1 hour before planning to be sexually active. You can take it with or without food, but keep in mind it may take longer to work if taken with a heavy meal. You only need to take Cialis when you are going to be sexually active.", "How to take Cialis Daily:", "Take 1 tablet whole with a glass of water at the same time each day. You may take it with or without food, as it will not affect how well it works. It is important that you take it regularly every day to ensure you get the full benefit of the medication, so it can be helpful to incorporate it into your daily routine (e.g. with coffee at breakfast).", "Cialis 36-Hour comes in two doses, either 10 mg or 20 mg. It is recommended to begin with the 10 mg tablet and continue if this is effective, as lower doses have less chance of side effects. If you find it is not having the desired effect on your erection after several separate attempts, you can try increasing the dose to 20 mg. If you are still not satisfied with the results, talk to your doctor about other medication solutions for you.", "Cialis Daily is available in two strengths of 2.5 mg and 5 mg. Usually men begin with the 5 mg dose and adjust as needed. If you find that you are experiencing side effects or the 5 mg seems to be too strong for you, you can try decreasing the dose to 2.5 mg.", "Cialis has a benefit over other erectile dysfunction medications because it is so quick to work, often effective enough to allow sexual intercourse just 20 minutes after taking the pill. This is because it is absorbed into the body more easily and goes into action sooner. While you can take Cialis with or without food, it may take slightly longer to work if you take it with or soon after a large meal.", "For Cialis Daily, it can take up to 5 days for the full effect to come into effect, as the low dose builds up gradually. However, after this time it will work continuously. ", "Cialis has an extremely long duration of action in comparison to other erectile dysfunction medications and has been noted to work up to 36 hours after taking the pill.", "Cialis Daily goes one step further to provide you with a ceaseless solution to erectile dysfunction. As it is a daily medication, you will always be ready for sexual activity."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/cialis"}, {"DRUG NAME": "Tadalafil (Generic Cialis)", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["2.5mg", "5mg", "10mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "28 tablets", "32 tablets", "64 tablets"], "UUID": "cbe02c77", "PRICE": "£19.99", "REVIEWS": "4.8", "INFORMATION": ["Tadalafil is the generic version of the Cialis, one of the most popular erectile dysfunction treatments.", "Tadalafil is the name of the active ingredient in Cialis and is a medication used to treat erectile dysfunction. It offers particularly long lasting effects in comparison to the other treatment options available and can produce results for up to 36 hours after taking a single pill in helping you to get and keep an erection.", "Tadalafil is the active ingredient in Cialis and is available in a generic, unbranded tablet. Tadalafil and Cialis are medically equivalent but Tadalafil is available at a much lower cost.", "Generic medicines contain the same active ingredient and are equally effective and medically equivalent as the branded products but are available at a lower price. Generic manufacturers have to demonstrate that they are medically identical to the branded product - i.e. they offer the same quality, strength, stability and effectiveness.", "Visit our Generic Medicine FAQ for more information.", "(read more about Cialis vs Tadalafil)", "Tadalafil daily capitalises on the long duration of action of tadalafil to provide a regular solution to erectile dysfunction. It comes in lower doses but should be taken every day. This means that you don’t need to time the medication before you will be sexually active but simply take a pill every day and you will always be ready for action.", "The active ingredient in Tadalafil is a type of drug called a PDE-5 (phosphodiesterase type 5) inhibitor. The majority of drugs used to treat erectile dysfunction work in the same way and increase the blood flow needed to the penis that is needed for an erection to occur.", "Usually an enzyme in the body makes the muscles around the blood vessels in the penis stay tight and keeps the blood vessel thin. Tadalafil stops this enzyme from working properly, which allows the blood vessels to expand and more blood can pass through, resulting in an erection.", "Tadalafil is effective for many men, independent of what the cause of the condition is, because it works on the very last step of the process needed for an erection to occur. On the other hand, as it works only on a physical level, it won’t help to increase sexual desire. ", "Tadalafil 36-Hour and Tadalafil Daily both contain the same medication but have different purposes and are there for taken differently.", "How to take Tadalafil 36 Hour:", "Take 1 tablet whole with a glass of water 30 minutes to 1 hour before planning to be sexually active. You can take it with or without food, but keep in mind it may take longer to work if taken with a heavy meal. You only need to take Tadalafil when you are going to be sexually active.", "How to take Tadalafil Daily:", "Take 1 tablet whole with a glass of water at the same time each day. You may take it with or without food, as it will not affect how well it works. It is important that you take it regularly every day to ensure you get the full benefit of the medication, so it can be helpful to incorporate it into your daily routine (e.g. with coffee at breakfast).", "Tadalafil 36-Hour comes in two doses, either 10 mg or 20 mg. It is recommended to begin with the 10 mg tablet and continue if this is effective, as lower doses have less chance of side effects. If you find it is not having the desired effect on your erection after several separate attempts, you can try increasing the dose to 20 mg. If you are still not satisfied with the results, talk to your doctor about other medication solutions for you.", "Tadalafil Daily is available in two strengths of 2.5 mg and 5 mg. Usually men begin with the 5 mg dose and adjust as needed. If you find that you are experiencing side effects or the 5 mg seems to be too strong for you, you can try decreasing the dose to 2.5 mg.", "Tadalafil has a benefit over other erectile dysfunction medications because it is so quick to work, often effective enough to allow sexual intercourse just 20 minutes after taking the pill. This is because it is absorbed into the body more easily and goes into action sooner. While you can take Tadalafil with or without food, it may take slightly longer to work if you take it with or soon after a large meal.", "For Tadalafil Daily, it can take up to 5 days for the full effect to come into effect, as the low dose builds up gradually. However, after this time it will work continuously. ", "Tadalafil has an extremely long duration of action in comparison to other erectile dysfunction medications and has been noted to work up to 36 hours after taking the pill.", "Tadalafil Daily goes one step further to provide you with a ceaseless solution to erectile dysfunction. As it is a daily medication, you will always be ready for sexual activity."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/generic-tadalafil"}, {"DRUG NAME": "Viagra Connect", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "28 tablets", "32 tablets", "64 tablets"], "UUID": "7bfa2064", "PRICE": "£16.99", "REVIEWS": "4.7", "INFORMATION": ["Viagra Connect is the first medicine to be licensed over the counter to treat erectile dysfunction. Viagra Connect is available in only 50mg and is identical to Viagra 50mg, which has been used by millions of men across the world since 1998. Viagra Connect belongs to a class of drugs known as PDE-5 (Phosphodiesterase type 5) inhibitors. Viagra Connect and the other PDE-5 inhibitors can help men with erectile dysfunction (male impotence) by enhancing the erectile response when a man is sexually stimulated.", "You should take Viagra Connect about one hour before you plan to have sex. Swallow the tablet whole with a glass of water.", "Viagra Connect can be taken with or without food. However, you may find that Viagra Connect takes longer to start working if you take it with a heavy meal.", "Viagra Connect belongs to a class of medication known as PDE5 inhibitors. In the presence of sexual stimulation, PDE5 inhibitors such as Viagra Connect relax smooth muscle and increase blood flow to the penis, helping to restore impaired erectile function.", "Viagra Connect will stay in the body on average 4 hours after dosing. For some men it may remain as long as 5 hours, or a few as 3 hours.", "Viagra Connect is generally well tolerated and the active ingredient has been used by millions of men across the world. The most common side effects include headache, flushing, indigestion, nasal congestion, dizziness, nausea, hot flush and visual disturbances. These common side effects are all transient in nature and should not last more than a few hours. Studies have not shown any effect on sperm motility or morphology.", "When taken on an empty stomach, Viagra Connect is absorbed relatively rapidly and it will usually work within 30-60 minutes, although it may take up to 120 minutes in a small percentage of men. Taking Viagra Connect with food will decrease the rate of absorption and can significantly increase the time taken for Viagra Connect to work.", "In the UK, Viagra Connect is an over the counter medicine and can be sold without prescription.", "Viagra Connect is registered and licensed for use in the UK and EU and can be safely taken by the majority of men with erectile dysfunction. Viagra was patented by Pfizer in 1996 and released onto the market a couple of years later. As a result, it has been safely used by millions of men around the world who have erectile dysfunction.", "Clinical trials of healthy men taking the active ingredient in Viagra Connect did not show further decreases in blood pressure when taken with moderate amounts of alcohol. However, alcohol by itself has the ability to increase erection difficulties.", "Viagra Connect should be taken approximately 30-60 minutes before intended sexual activity and on an empty stomach. Only 1 tablet should be taken in each 24 hour period."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/viagra-connect"}, {"DRUG NAME": "Spedra", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["50mg", "100mg", "200mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "24 tablets", "32 tablets"], "UUID": "63a00271", "PRICE": "£24.99", "REVIEWS": "4.5", "INFORMATION": ["Spedra contains the active ingredient avanafil and is used to effectively treat erectile dysfunction. It has a quick onset of action in comparison to other treatment options available and many men find that it works effectively just 15 minutes after taking the pill. It is one of the most recent drugs to be released for use in the treatment of erectile dysfunction.", "Viagra contains the active ingredient sildenafil whereas Spedra contains avanafil. They are two completely different drugs, although they have a similar effect on the body. They both work by increasing blood flow to the penis for an erection to occur, are equally effective and last a comparable amount of time. However, Spedra is absorbed more quickly and hence begins to work faster.", "Erectile dysfunction involves difficulty for men in getting and keeping an erection adequate for sexual activities. It is also sometimes known as impotence.", "Normally when you are sexually aroused your brain receives sensory messages - what you feel and see - and reacts by changing hormone levels and relaxing certain muscles around blood vessels in the penis. This allows more blood to flow through the enlarged vessels to allow an erection to occur.", "The most common cause of erectile dysfunction is cardiovascular disease because the blood vessels are particularly important in the final step of getting an erection. However, as it is such a complex process, there are many possible causes. For example, psychological causes like stress and anxiety can affect the brain's response to arousal and cause erectile problems.", "It is important to seek treatment early as sexual performance problems can cause further anxiety and set a pattern of failure. Treatment can help to remove the physical barriers and allow you to address the issues with your partner or therapist in the meantime.", "The active ingredient in Spedra, avanafil, is a type of drug called a PDE-5 (phosphodiesterase type 5) inhibitor, like the majority of drugs available for the treatment of erectile dysfunction.", "Spedra stops a particular enzyme in the body from working properly, preventing it from keeping the muscles surrounding the blood vessels in the penis tight. As a result, the blood vessels can widen and allow more blood to pass through and an erection to occur.", "Regardless of the cause of erectile dysfunction, Spedra can work effectively as it affects the very last step of the erection process. However, as it works specifically on the physical side of things, it won't help to increase sexual desire.", "You should take 1 tablet whole with a glass of water 30 minutes to 1 hour before planning to have sex. Whilst some men find it is effective within 15 minutes, waiting this time will allow your body more time to experience the effects of the drug.", "You can take Spedra with or without food as desired, although if you take it with or soon after a large meal it may take slightly longer to work.", "Spedra comes in three doses: 50, 100 and 200 mg. For people beginning treatment with Spedra, it is recommended to begin with the standard dose of 100mg. If this is effective for you and you do not experience any other problems, continue with this dose.", "However, if you experience side effects that bother you, you may prefer to try decreasing the dose to 50 mg. This helps many men to decrease unwanted effects whilst maintaining the desired effect.", "On the other hand, some men find that the standard dose is not powerful enough to give the results they desire. If after trying the standard dose on 4 separate occasions and you are not happy with the outcome, you may try increasing the dose to 200 mg. If this is still not effective and you have tried on 8 separate occasions, you should see your doctor for information on other treatment options for you.", "All medications have an effect on the body and can also produce unwanted side effects. The most common side effects for Spedra are:", "If you notice these side effects and they bother you, you may be able to eliminate them by trying the lower dose of Spedra. If you still experience these effects, you should talk to your doctor about other treatment options."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/spedra"}, {"DRUG NAME": "Levitra", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["5mg", "10mg", "20mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "32 tablets"], "UUID": "60345f67", "PRICE": "£29.99", "REVIEWS": "4.8", "INFORMATION": ["Levitra is available in 5mg, 10mg, 20mg. Take one tablet 60 minutes before sexual activity. The recommended starting dose of Levitra is 10 mg."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/levitra"}, {"DRUG NAME": "Vardenafil (Generic Levitra)", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["5mg", "10mg", "20mg"], "QUANTITY AVAILABLE": ["4 tablets", "8 tablets", "12 tablets", "16 tablets", "32 tablets"], "UUID": "a1b4d885", "PRICE": "£29.99", "REVIEWS": "5", "INFORMATION": ["Vardenafil is available in 5mg, 10mg, 20mg. Take one tablet 60 minutes before sexual activity. The recommended starting dose of Vardenafil is 10 mg."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/vardenafil"}, {"DRUG NAME": "Vaxaid Deluxe ED Pump", "ALTERNATIVES": ["viagra", "generic-sildenafil", "cialis", "generic-tadalafil", "viagra-connect", "spedra", "levitra", "vardenafil", "vaxaid"], "DOSAGES AVAILABLE": ["5\"", "7\"", "9\""], "QUANTITY AVAILABLE": ["1"], "UUID": "9444f53d", "PRICE": "£179.99", "REVIEWS": "5", "INFORMATION": ["VaxAid is the only vacuum system to tackle ED using both the power of water for penile vascular exercise in the shower or bath and also in air for generating and maintaining an erection prior to sexual activity.", "", "Made from high impact polycarbonate with a super Elastomer skin safe bellows pump, VaxAid when used in water is amongst the most powerful vacuum devices available yet operates within medical regulations. The product also undergoes extensive testing and is tough enough to withstand accidental dropping in the shower or bath."], "DRUG URL": "https://www.medexpress.co.uk/clinics/erectile-dysfunction/vaxaid"}]