[{"DRUG NAME": "Period Delay Tablets", "ALTERNATIVES": ["norethisterone"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["7 Day Period Delay (30 tablets)", "17 Day Period Delay (60 tablets)"], "UUID": "829ed16b", "PRICE": "£15.99", "REVIEWS": "4.9", "INFORMATION": ["Utovlan also known as Norethisterone period delay pills work in a similar way to the hormone progesterone, which occurs naturally in the body. It delays your period until the tablets are stopped. You will need to take one tablet three times a day, starting three days before your period is due to start and continuing for no more than 14 days afterwards (17 days in total). Your period will be delayed while you are taking the tablets and should start within three days of stopping the tablets.", "Utovlan period delay tablets contain Norethisterone which is a form of progesterone, a female hormone, which prevents your uterus from getting rid of its lining as it usually does, when menstruation begins. It comes in the form of a tablet and the dosage strength to delay periods is 5 mg three times daily. You are required to start taking the tablet at least three days before your period is due and to continue taking it for the duration that you would like to delay your period.", "It is recommended that Norethisterone 5mg tablets should be taken to delay your period for a maximum of 17 days. It is perfectly safe to delay your period for this amount of time. After you stop taking the tablets, your period is likely to start after two or three days, however the time scale may be different for every individual. This dose of Norethisterone is not recommended for prolonged use, as it can cause side effects and affect your hormone balance.", "Norethisterone 5mg tablets should be taken three times a day, usually at the same time each day. If you forget to take a tablet on one day, you may continue taking the regular dose on the following day, or when the next dose is due. Do not take two doses together. Read the patient information leaflet, as this will give you more information about the medicine.", "Norethisterone does not normally cause side effects as it is taken for such a short period of time. However, the most common side effects which some women may experience are rashes, itching, dizziness and headaches, nausea or depression. More serious side effects can include thrombosis or jaundice, fluid retention (which can lead to high blood pressure) and migraines.", "Norethisterone cannot protect against pregnancy, as it is not a contraceptive. You may wish you consider taking the combined oral contraceptive pill to prevent pregnancy. The combined oral contraceptive can also be used to delay periods, when the ‘tablet free’ interval is omitted.", "Some women may not observe their period a few days after they stop treatment with Norethisterone, but it may be slightly delayed whilst your body takes time to re-adjust to the hormone changes. However, its recommended to take a pregnancy test if you do not get your period within a week of ceasing treatment, to rule out the possibility of pregnancy. The period delay tablets are not a contraceptive and you should always use extra contraceptive methods during treatment. If you still do not observe your period, you should seek medical advice.", "You can take one Norethisterone tablet three times a day, starting three days before you expect to start your next period. You should keep taking the tablets until you are ready to re-start your period (maximum treatment is 17 days).", "The above is not an exhaustive list of medicines that interact with Norethisterone, and women should seek medical advice or speak to your pharmacist before taking the tablets."], "DRUG URL": "https://www.medexpress.co.uk/clinics/period-delay/norethisterone"}]