[{"DRUG NAME": "COVID-19 Home Test Kit", "ALTERNATIVES": ["coronavirus-covid19-home-testing-kit-pcr", "coronavirus-covid19-antibody-test", "lateral-flow-test", "personal-lateral-flow-test"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 test kit", "2 test kits", "3 test kits", "4 test kits", "5 test kits"], "UUID": "e3cec8b6", "PRICE": "£110.00", "REVIEWS": "4.4", "INFORMATION": ["It’s quick, reliable and accurate to test for COVID-19 Coronavirus from MedExpress — your fully regulated, London, United Kingdom based online pharmacy.", "Order up to 5 Coronavirus (Covid-19) home collection test kits online. The tests will be sent to you by next day delivery.", "Use the self collection throat and nasal swabs as directed and send the kits back using the prepaid envelope from a priority post box Monday - Friday.", "Your samples will be analysed in the lab and you will be notified of the results by SMS and email. Results can be checked online.", "If you are experiencing any of the symptoms of COVID-19 coronavirus, if you have been in contact with someone who has been infected or if you have recently been in a country with a high incidence of COVID-19, you can take a test to determine if you have been infected.", "The Coronavirus home collection test kit contains a nasal and throat swab which collect a sample of cells which is sent back to a lab for testing. The lab peforms a very sensitive test that looks for the RNA of the virus using a technique called RT-PCR. RT-PCR tests work by detecting specific genetic material known as viral RNA within the virus. By detecting viral RNA, which will be present in the body before symptoms of the disease are present, the tests can tell whether or not someone has the virus very early on.", "The collection kit will be sent directly to your home. You will use the nasal and throat swab and return the sample in the prepaid envelope to the lab for analysis. You will be notified of the results in 2-3 days.", "You will need to post your swab via a priority post box before Midday on the same day that the test is taken. You can identify priority post boxes by accessing the Royal Mail app or website and typing in your postcode.", "You should not post your results on a Saturday or Sunday.", "The results will take 2-3 days once the lab has received it. You will be alerted as soon as the results have been received. Beware of rapid tests being sold which offer instant results as these are not advised by the UK government.", "You will receive an email and SMS notification when the lab has produced the results and you can login to our secure portal on our website to view the results. If you would like to receive an SMS with the test results you can add your mobile number to the form which comes with your test kit and the lab will message you the results directly.", "We provide a fit to fly certificate which you can download from your online account as soon as your tests results have been processed by our partner lab.", "The requirements for fit to fly certificates vary by airline and country, and are rapidly changing with the global situation. Please download our sample certificate from here to check if it satisfies the requirements for your journey. You can see the latest guidance for foreign travel here.", "If you require a passport or travel document number on your Fit to Fly certificate, please email hello@medexpress.co.uk with the subject PASSPORT - CERT, along with a photo of your passport/travel document, clearly displaying the document number, and our team will update your certificate.", "Yes these tests are completely legal. These are different to the rapid testing blood Coronavirus test kits which not advised by the UK government", "No, these tests will not tell if you have previously been infected or whether you are currently immune, they will only tell you if you are currently infected. Once you have recovered the virus is eliminated and these tests can no longer tell if you’ve been infected.", "Yes, for any doctors or NHS staff we are committed to providing the tests for no profit. Please contact us at hello@medexpress.co.uk for further details.", "Unfortunately, MedExpress tests cannot currently be used for test and release.", "The main symptoms are:"], "DRUG URL": "https://www.medexpress.co.uk/testing/covid19/coronavirus-covid19-home-testing-kit-pcr"}, {"DRUG NAME": "Private COVID-19 Antibody Testing", "ALTERNATIVES": ["coronavirus-covid19-home-testing-kit-pcr", "coronavirus-covid19-antibody-test", "lateral-flow-test", "personal-lateral-flow-test"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 test kit", "2 test kits", "3 test kits", "4 test kits", "5 test kits"], "UUID": "e326444c", "PRICE": "£50.00", "REVIEWS": "4.4", "INFORMATION": ["Order up to 5 Coronavirus Antibody test kits online. The tests will be sent to you by next day delivery.", "Use the fingerprick collection device as directed and send the kits back using the prepaid envelope.", "Your samples will be analysed in the lab and you will be notified of the results by SMS and email. Results can be checked online.", "This kit is designed for use by persons aged 18 and over.", "This kit should not be used by persons with bleeding or clotting disorders, those taking anti-coagulants, or by patients taking immunosuppressive drugs or undergoing chemotherapy.", "Those patients wanting to know if they have had COVID-19 or been exposed to the virus and recovered. This test can help test for that.", "Symptoms of Covid-19 - at least 14 days from onset (ideally 21 days).", "Possibly exposed but had no symptoms (asymptomatic) - then 14 days (at the earliest) to 21 days after exposure.", "An estimated 80% of Covid-19 infected patients have no symptoms or no specific Covid-19 symptoms1.", "Testing too early may result in a false negative test (negative result but you have been exposed and made antibodies to Covid).", "If you have symptoms of Covid-19 or had very recent exposure, the PCR swab test we offer is more appropriate.", "It requires you to provide a small blood sample from a finger-prick using the kit supplied. This is collected in a special container which you post to the lab for testing. The lab analyses the sample for antibodies to the Covid-19 virus. A positive test suggests you have most likely had Covid-19 and made antibodies to it.", "Here’s a link to a short video showing the technique.", "Molecular testing (PCR Swab) will identify people with the virus. Antibody testing can tell whether a person has been previously infected. Most patients who recover from coronavirus have been found to produce antibodies, but it is not yet known if an individual with a positive result showing presence of IgG levels following being infected with SARS-CoV-2 will be protected, either fully or partially from future infection, or for how long protective immunity may last.\nTesting should be undertaken 14 days or more following exposure or onset of symptoms. The incubation period of COVID-19 ranges from between 1 to 14 days, with the majority of cases manifesting with symptoms at 3–5 days. The most common symptoms of COVID-19 are fever, tiredness, dry cough and difficulty breathing. These symptoms have the potential to develop into a very severe acute respiratory illness. Evidence shows that fatality rates increase with age, gender, body weight, ethnicity and comorbidities.", "Post it in any Royal Mail post box on the same day that the test is taken.", "Do not do the test on a Saturday or Sunday to avoid a delay in it being received in the lab.", "The results will take 2-3 days. You will be alerted as soon as the results have been received.", "You will receive an email and SMS notification when it’s done and you can login to our secure website portal to view the results. If you would like to receive an SMS with the test results, you can add your mobile number to the form which comes with your test kit and the lab will message you the results directly.", "Roche have an outstanding global reputation and have received CE Mark and MHRA clearance for this test.", "Correct, a positive test suggests it is very likely you have been infected / exposed to Covid-19 in the past AND formed an antibody immune response.", "There is not enough scientific evidence to confirm if having antibodies means you are definitely immune.", "At the time of writing, some human reinfections with SARS-CoV-2 have been confirmed in patients who had antibodies but this is extremely rare. This suggests the body usually develops significant immunity as antibody levels seem to rise in patients as viral counts drop and reinfections are very uncommon.", "We also do not know how long any immunity to Covid-19 lasts. Currently research suggests antibody levels can slowly fall in people who had asymptomatic exposure. Whether this means they are more prone to reinfection is unknown.", "Following the 2002 SARS virus outbreak the responsible virus SARS-CoV was studied extensively. Research showed patients with antibodies were immune over a 3 year period2. Covid-19 (SARS-Cov2) is closely related to SARS-CoV, both viruses having originated in bats.", "The Roche Diagnostics test has specificity of 99.98% and sensitivity of 98.8%. In our opinion it is one of the best of its kind in the world and is processed at the largest private clinical laboratory in the U.K.", "Please note:", "The main symptoms are:"], "DRUG URL": "https://www.medexpress.co.uk/testing/covid19/coronavirus-covid19-antibody-test"}, {"DRUG NAME": "Lateral flow tests for entry to the UK", "ALTERNATIVES": ["coronavirus-covid19-home-testing-kit-pcr", "coronavirus-covid19-antibody-test", "lateral-flow-test", "personal-lateral-flow-test"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 test kit", "2 test kits", "3 test kits", "4 test kits", "5 test kits"], "UUID": "7b2fc262", "PRICE": "£19.00", "REVIEWS": "5", "INFORMATION": ["Based on the latest government guidelines, all international arrivals to the UK must complete a lateral flow test before they enter the country within two days before they depart. This is to ensure that new arrivals do not carry COVID-19 following their return, and to identify cases prematurely before people enter the community.", "", "This is a separate test to the mandatory PCR test that is needed on day 2 of arrival to the UK, which needs to be booked."], "DRUG URL": "https://www.medexpress.co.uk/clinics/covid-19/lateral-flow-test"}, {"DRUG NAME": "Lateral flow tests", "ALTERNATIVES": ["coronavirus-covid19-home-testing-kit-pcr", "coronavirus-covid19-antibody-test", "lateral-flow-test", "personal-lateral-flow-test"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["5 test kits", "10 test kits", "20 test kits"], "UUID": "ab7b9784", "PRICE": "£15.00", "REVIEWS": "5", "INFORMATION": ["Lateral flow tests are recommended by the NHS for people to complete on a regular basis to ensure to check that they are."], "DRUG URL": "https://www.medexpress.co.uk/clinics/covid-19/personal-lateral-flow-test"}]