[{"DRUG NAME": "Duac", "ALTERNATIVES": ["duac", "epiduo", "differin"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 x 30g", "2 x 30g", "3 x 30g"], "UUID": "7c049dc6", "PRICE": "£24.99", "REVIEWS": "4.5", "INFORMATION": ["Duac is a treatment for mild to moderate acne. It comes in gel form and contains two main ingredients - clindamycin, an antibiotic; and benzoyl peroxide, an antibacterial and keratolytic (peeling) agent, which reduces acne causing bacteria and reduces blackheads and whiteheads.", "Gently wash the affected area with a mild cleanser and make sure the skin is completely dry afterward. Apply a small amount of gel to the entire affected area/s each evening and rub in. If the gel does not easily rub into the skin then you are using too much. You should wash your hands after each application. Allow the gel to dry on the skin, do not wash it off.", "You would expect to see improvement of your acne after 2-5 weeks of daily use, with the maximum benefit being seen in around 8-12 weeks. Treatment should only be continued up to a maximum of 12 weeks.", "Before purchase, Duac will be stored in the refrigerator. However, once you receive the item it can be stored out of the fridge, up to 25°C. Duac must be discarded after 2 months."], "DRUG URL": "https://www.medexpress.co.uk/clinics/acne/duac"}, {"DRUG NAME": "Epiduo Gel", "ALTERNATIVES": ["duac", "epiduo", "differin"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 x 45g", "2 x 45g"], "UUID": "67a532a4", "PRICE": "£33.00", "REVIEWS": "4.9", "INFORMATION": ["Epiduo is a gel that is used in the treatment of moderate to severe acne. It contains two active ingredients; benzoyl peroxide and adapalene. These ingredients are both used to treat acne and they work in different ways.", "Benzoyl peroxide is an antimicrobial agent and works by killing bacteria on the skin.", "Adapalene belongs to a group of medicines called retinoids (which includes tretinoin) and helps to reduce inflammation and black and white head formation on the outer layer of the skin. Adapalene is an advanced third generation retinoid which exhibits many of the same effects as previous generation medicines like tretinoin but is often tolerated better.", "Apply a thin layer of gel evenly over the acne affected areas only once daily at bedtime. Do not apply near or to the eyes, lips, nostrils or other sensitive areas. The gel should be applied to clean, dry skin and take care to wash your hands thoroughly before and after use.", "Do not apply to broken skin.", "Epiduo is a prescription only medicine and cannot be bought over the counter. If you are interested in this medicine, why not fill out our consultation questionnaire? This will be reviewed by one of our expert prescribers who will advise if this medicine is suitable and safe for you.", "As with all medicines applied to the skin in the treatment of acne, you may not see results for up to eight weeks. It is important to be consistent in your application of this gel in order for it to work properly.", "One study compared the efficacy of Epiduo to a placebo and showed that after 12 weeks of treatment, 27.5% of patients using Epiduo were clear or almost clear of acne compared to 9.9% of patients who used a placebo. The same study also compared Epiduo to each single active ingredient that is in it. After 12 weeks, adapalene had a success rate of 15.5% and benzoyl peroxide was 15.4%.", "Epiduo is not suitable for those with a hypersensitivity to any of the ingredients. Do not use in pregnancy. Avoid sunlight and UV lamps while using this medicine. Do not use other acne products containing retinoids or benzoyl peroxide while using this medicine or products that are irritating, drying or exfoliating to the skin."], "DRUG URL": "https://www.medexpress.co.uk/clinics/acne/epiduo"}, {"DRUG NAME": "Differin (Adapalene) 0.1%", "ALTERNATIVES": ["duac", "epiduo", "differin"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["1 Tube", "2 Tubes", "3 Tubes"], "UUID": "1a4fbc8f", "PRICE": "£33.00", "REVIEWS": "4.9", "INFORMATION": ["Differin is a gel that is used in the treatment of moderate to severe acne. It contains the active ingredients adapalene.", "Adapalene belongs to a group of medicines called retinoids (which includes tretinoin) and helps to reduce inflammation and black and white head formation on the outer layer of the skin. Adapalene is an advanced third generation retinoid which exhibits many of the same effects as previous generation medicines like tretinoin but is often tolerated better.", "Apply a thin layer of gel evenly over the acne affected areas only once daily at bedtime. Do not apply near or to the eyes, lips, nostrils or other sensitive areas. The gel should be applied to clean, dry skin and take care to wash your hands thoroughly before and after use.", "Do not apply to broken skin.", "Differin is a prescription only medicine and cannot be bought over the counter. If you are interested in this medicine, why not fill out our consultation questionnaire? This will be reviewed by one of our expert prescribers who will advise if this medicine is suitable and safe for you.", "As with all medicines applied to the skin in the treatment of acne, you may not see results for up to eight weeks. It is important to be consistent in your application of this gel in order for it to work properly.", "Differin is not suitable for those with a hypersensitivity to any of the ingredients. Do not use in pregnancy. Avoid sunlight and UV lamps while using this medicine. Do not use other acne products containing retinoids or benzoyl peroxide while using this medicine or products that are irritating, drying or exfoliating to the skin."], "DRUG URL": "https://www.medexpress.co.uk/clinics/acne/differin"}]