[{"DRUG NAME": "Propecia", "ALTERNATIVES": ["propecia", "finasteride", "regaine"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["4 weeks (most common)", "8 weeks", "12 weeks", "28 tablets"], "UUID": "6c983a47", "PRICE": "£15.99", "REVIEWS": "4.8", "INFORMATION": ["Propecia is a drug used to treat male pattern hair loss, a common condition that involves hair thinning on the scalp that often leads to a receding hair line or balding on the crown of your head. It affects some men from 20 years old and is more common as men age, affecting the majority of males at some stage throughout their life.", "Finasteride is the generic name of the drug and is the active ingredient in the medication that works to reduce hair loss.", "Alopecia is another name that refers to male pattern hair loss. Normally, one hair grows from each hair follicle for about three years. After this time, it is shed and is closely followed by a new hair growing from the same follicle.", "For men with male pattern hair loss, the hair follicles become smaller over time and each hair is thinner and falls out sooner than previously. Eventually, this can lead to hair follicles so small that the hair does not reach the skin surface.", "The main cause behind this change in the hair follicles is an androgenic hormone called dihydrotestosterone. It is for this reason that this hormone is the target for drugs to treat alopecia.", "", "", "The active component of Propecia, Finasteride, works to inhibit an enzyme in the body called 5-alpha-reductase. This enzyme usually converts testosterone into dihydrotestosterone, the more potent androgen that has a negative effect on hair growth.", "As a result of using Propecia, the levels of the dihydrotestosterone hormone are lower and a positive effect can be seen on the maintenance of hair and hair growth of men who suffer from male pattern hair loss.", "With regular Propecia treatment you may begin to see the results within a few months, although it could take up to a year to notice the full benefit. It is important that you continue treatment long enough to see the results on male pattern hair loss, as the improvement won't occur overnight.", "If you haven't noticed a benefit after using Propecia regularly for one year or more, further treatment is unlikely to benefit and it is recommended to stop use.", "If you decide to stop treatment with Propecia, you will likely lose any hair growth gained in the previous 12 months of treatment. It is recommended to discuss your options and the best solution for you with your doctor."], "DRUG URL": "https://www.medexpress.co.uk/clinics/hair-loss/propecia"}, {"DRUG NAME": "Finasteride", "ALTERNATIVES": ["propecia", "finasteride", "regaine"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["4 weeks (most common)", "8 weeks", "12 weeks", "28 tablets"], "UUID": "a6137484", "PRICE": "£15.99", "REVIEWS": "4.8", "INFORMATION": ["Finasteride is a drug used to treat male pattern hair loss, a common condition that involves hair thinning on the scalp that often leads to a receding hair line or balding on the crown of your head. It affects some men from 20 years old and is more common as men age, affecting the majority of males at some stage throughout their life.", "Finasteride is the generic name of the drug and is the active ingredient in the medication that works to reduce hair loss.", "Finasteride is the active ingredient in Propecia and is available in a generic, unbranded tablet. Finasteride and Propecia are medically equivalent but Finasteride is available at a much lower cost.", "Generic medicines contain the same active ingredient and are equally effective and medically equivalent as the branded products but are available at a lower price. Generic manufacturers have to demonstrate that they are medically identical to the branded product - i.e. they offer the same quality, strength, stability and effectiveness.", "Alopecia is another name that refers to male pattern hair loss. Normally, one hair grows from each hair follicle for about three years. After this time, it is shed and is closely followed by a new hair growing from the same follicle.", "For men with male pattern hair loss, the hair follicles become smaller over time and each hair is thinner and falls out sooner than previously. Eventually, this can lead to hair follicles so small that the hair does not reach the skin surface.", "The main cause behind this change in the hair follicles is an androgenic hormone called dihydrotestosterone. It is for this reason that this hormone is the target for drugs to treat alopecia.", "When the hair has been gone for extended periods of time, the hair may become permanently lost hence timely treatment is beneficial.", "The active component if Finasteride, works to inhibit an enzyme in the body called 5-alpha-reductase. This enzyme usually converts testosterone into dihydrotestosterone, the more potent androgen that has a negative effect on hair growth.", "As a result of using Finasteride, the levels of the dihydrotestosterone hormone are lower and a positive effect can be seen on the maintenance of hair and hair growth of men who suffer from male pattern hair loss.", "With regular Finasteride treatment you may begin to see the results within a few months, although it could take up to a year to notice the full benefit. It is important that you continue treatment long enough to see the results on male pattern hair loss, as the improvement won't occur overnight.", "If you haven't noticed a benefit after using Finasteride regularly for one year or more, further treatment is unlikely to benefit and it is recommended to stop use.", "If you decide to stop treatment with Finasteride, you will likely lose any hair growth gained in the previous 12 months of treatment. It is recommended to discuss your options and the best solution for you with your doctor."], "DRUG URL": "https://www.medexpress.co.uk/clinics/hair-loss/finasteride"}, {"DRUG NAME": "Regaine Foam", "ALTERNATIVES": ["propecia", "finasteride", "regaine"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["3x73ml (3 Months)", "6x73ml (6 Months)", "9x73ml (9 Months)", "12x73ml (12 Months)"], "UUID": "e2ae5aca", "PRICE": "£48.99", "REVIEWS": "4.7", "INFORMATION": ["Regaine is an effective hair-loss pharmacy medicine, which has been proven to reduce hair loss and encourage hair growth. It has been proven to be effective for 60% of men. It is the first and only topical treatment licensed for hair loss in the UK.", "Regaine works by stimulating hair follicles to move from resting phase to growth phase. It also increases the length of the growth phase. The resting phase normally lasts 6 weeks in a healthy hair follicle. Therefore, it is important to use Regaine regularly for at least that amount of time or longer in order to see results of hair growth. Results may be seen within 8 weeks, and may take up to 16 weeks to show.", "Regaine also dilates the blood vessels, allowing more oxygen, blood and nutrients to the hair follicle. This encourages hair to grow. Regaine increases the diameter of the hair shaft, which encourages the thickness of the follicles, so that hair growth is fuller.", "Regaine has proven to prevent hair loss in 4 out of 5 men and re-grows hair in 9 out of 10 men. The foam application can be part of men’s everyday grooming routine as it is easy to use, it is unscented and dissolves into the scalp quickly.", "Male pattern baldness is a common condition, which affects over 6.5 million men in the UK.", "Is your brush or comb raking out more hair than usual? And are you also noticing thinning on top or perhaps a more pronounced hairline at the sides? Although it’s possible that this loss could be caused by a medical disorder, prescribed medication, poor nutrition, bad hair care techniques or severe stress, in 95% of cases the cause is hereditary – and is known as male pattern baldness, or androgenetic alopecia.", "In the case of hereditary hair loss, the genes and hormones in your body have a shrinking effect on your hair follicles, making them ineffective at growing new hairs. Over time, the progressive shrinking of certain scalp follicles leads to a shortening of the hair's growing cycle. Hair becomes thinner and shorter, until there is no growth at all.", "Fortunately, there is something you can do about it. Hereditary hair loss can be effectively treated using Regaine Foam."], "DRUG URL": "https://www.medexpress.co.uk/clinics/hair-loss/regaine"}]