[{"DRUG NAME": "Sumatriptan", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": ["50mg", "100mg"], "QUANTITY AVAILABLE": ["6 tablets", "12 tablets", "18 tablets", "24 tablets"], "UUID": "6d05737a", "PRICE": "£15.99", "REVIEWS": "4.9", "INFORMATION": ["Sumatriptan Generic is a popular migraine treatment. It is the generic version of Imigran, and like Imigran it contains the active ingredient sumatriptan succinate. Sumatriptan belongs to a class of medications known as triptans. Triptans are different to painkilling medications, as they work to reverse the changes in the brain that are thought to induce a migraine attack. They also work to alleviate the symptoms associated with a migraine.", "Imigran is the branded version of the generic medicine Sumatriptan. Generic medicines are medically equivalent to their branded version but are available at a lower price.", "Sumatriptan succinate is thought to reverse the temporary widening of blood vessels in the brain. The widening of these blood vessels is thought to contribute to a migraine attack. By stimulating receptors called serotonin (or 5HT) receptors found in the brain and therefore contracting the blood vessels, sumatriptan succinate works to treat the cause of a migraine, as well as helping to reduce any associated symptoms such as headache, nausea, vomiting and sensitivity to light or sound.", "Sumatriptan should be used when simple analgesics such as paracetamol, aspirin, ibuprofen or these simple analgesics combined with codeine are not effective. Sumatriptan can be used by people who experience less than 10 episodes of migraine each month. Sumatriptan should be taken at the beginning of a migraine, but it should not be taken to prevent a migraine, rather only to treat one.", "It does not matter if you take Sumatriptan with or without food. Take Sumatriptan with some water. One dose of Sumatriptan should be taken at the beginning of migraine onset. Wait for at least two hours after the first dose before taking a second dose. You should only take a second dose if the first dose was at least somewhat effective, but it did not completely relieve your migraine symptoms or your headache came back. You should not take a second Sumatriptan dose if the first dose did not work, but you can try taking Sumatriptan again for a future migraine.", "There is the potential for all medications to cause side effects. However, the particular side effects experienced will vary from person to person. Sumatriptan is safe and effective for the majority of people who are eligible for treatment with it. Some common side effects that may be associated with Sumatriptan can include nausea, vomiting, tiredness/drowsiness, or dizziness. These side effects affect less than 1 in 10 people. If you have any concerns about side effects, please talk to your doctor or pharmacist.", "A medication overuse headache, or a rebound headache, can be caused by the overuse of the drugs used to treat migraines. This is why it is very important that you speak to your doctor if you need to take more than 10 doses of Sumatriptan tablets in a month. Your doctor may instead need to discuss prescribing you preventative medication that you can take regularly to help prevent migraines."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/sumatriptan"}, {"DRUG NAME": "Imigran 50mg", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["6 tablets", "12 tablets", "18 tablets", "24 tablets"], "UUID": "eb184aae", "PRICE": "£15.99", "REVIEWS": "5", "INFORMATION": ["Imigran contains the active ingredient sumatriptan succinate and is a popular migraine treatment. It belongs to a class of medications known as triptans. Triptans are not the same as painkillers, instead they work by reversing the changes in the brain which can cause migraines. Reversing these changes helps to relieve the symptoms of migraine. Triptans are not the same as painkillers, instead they work by reversing the changes in the brain which can cause migraines. Reversing these changes helps to relieve the symptoms of migraine.", "Imigran and Sumatriptan Generic are medically equivalent. Imigran is a brand name and contains the active ingredient Sumatriptan succinate. Imigran is made by GlaxoSmithKline and was the first medication containing sumatriptan succinateavailable in the UK and Europe (and the rest of the world). Sumatriptan succinate is now available as a generic version that is medically equivalent to Imigran, but Sumatriptan Generic is available at a much lower cost.", "It is thought that the symptoms associated with a migraine might be due to the temporary widening of blood vessels in the brain. Imigran works by stimulating receptors called serotonin (or 5HT) receptors that are found in the brain, which causes the blood vessels in the brain to contract. By reversing the widening of these blood vessels, Imigran works to treat the cause of the migraine.", "The triptan class of medications are used when simple analgesics are not effective and when migraines are experienced less frequently than 10 episodes each month. There are a number of different triptans available, and as each person is different, some triptans will work better than others for each individual. Imigran should be taken at the onset of a migraine. It should not be taken as a preventative medication, as it does not help to prevent migraines, rather it only treats them.", "Imigran is not affected by food, so you can take it irrespective of your last meal. Take Imigran with some water. Take one dose of Imigran tablets at the onset of a migraine. Do not take another dose until at least two hours have passed, and only take a second dose if the first dose does not completely relieve your symptoms or your headache comes back. Do not take another dose if the first dose did not work at all, but you may take Imigran again for a future migraine.", "All medications have the potential to cause side effects. However, the side effects experienced differ from individual to individual. Fortunately, Imigran is safe and effective for the majority of people who are eligible for treatment with it. Some common side effects, affecting less than 1 in 10 people, can include nausea, vomiting, tiredness or drowsiness, or dizziness. Speak to your doctor or pharmacist if you have any concerns about side effects."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/imigran"}, {"DRUG NAME": "Rizatriptan - Migraine Treatment", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["3 tablets", "6 tablets", "9 tablets", "12 tablets"], "UUID": "b109cfee", "PRICE": "£11.99", "REVIEWS": "4.8", "INFORMATION": ["Rizatriptan is a popular migraine treatment, which belongs to a class of medications known as triptans. Triptans are not the same as pain killers, instead they work by reversing the changes in the brain which can cause migraines. By reversing these changes, Rizatriptan works to treat the cause of the migraine as well as reducing the symptoms.", "Rizatriptan works by stimulating receptors called serotonin (or 5HT) receptors that are found in the brain, which causes the blood vessels in the brain to contract. The narrowing of the blood vessels reverses the widening, which is thought to be one of the causes of migraines."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/rizatriptan"}, {"DRUG NAME": "Maxalt", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": "only one dose available", "QUANTITY AVAILABLE": ["3 tablets", "6 tablets", "9 tablets", "12 tablets"], "UUID": "bd658f15", "PRICE": "£28.99", "REVIEWS": "5", "INFORMATION": ["Maxalt belongs to a class of medicines called selective serotonin 5-HT1B/1D receptor agonists. Maxalt contains the active ingredient rizatriptan which is a type of triptan medication used for treating migraines.\nMaxalt is used to treat the headache phase of the migraine attack in adults.", "Maxalt works by stimulating receptors called serotonin (or 5HT) receptors that are found in the brain, which causes the blood vessels in the brain to contract. The narrowing of the blood vessels reverses the widening, which is thought to be one of the causes of migraines."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/maxalt-melt"}, {"DRUG NAME": "Zolmitriptan", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": ["2.5mg", "5mg (Orodispersible)"], "QUANTITY AVAILABLE": ["6 tablets", "12 tablets"], "UUID": "dca537d2", "PRICE": "£14.99", "REVIEWS": "4.9", "INFORMATION": ["Zolmitriptan is a popular migraine treatment, which belongs to a class of medications known as triptans. Triptans are not the same as pain killers, instead they work by reversing the changes in the brain which can cause migraines. By reversing these changes, Zolmitriptan works to treat the cause of the migraine as well as reducing the symptoms.", "Zolmitriptan works by stimulating receptors called serotonin (or 5HT) receptors that are found in the brain, which causes the blood vessels in the brain to contract. The narrowing of the blood vessels reverses the widening, which is thought to be one of the causes of migraines."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/zolmitriptan"}, {"DRUG NAME": "Zomig", "ALTERNATIVES": ["sumatriptan", "imigran", "rizatriptan", "maxalt-melt", "zolmitriptan", "zomig"], "DOSAGES AVAILABLE": ["2.5mg", "5mg (Orodispersible)", ""], "QUANTITY AVAILABLE": ["6 tablets", "12 tablets"], "UUID": "c8c099d9", "PRICE": "£14.99", "REVIEWS": "5", "INFORMATION": ["Zomig is a popular migraine treatment, which belongs to a class of medications known as triptans. Triptans are not the same as pain killers, instead they work by reversing the changes in the brain which can cause migraines. By reversing these changes, Zomig works to treat the cause of the migraine as well as reducing the symptoms.", "Zomig works by stimulating receptors called serotonin (or 5HT) receptors that are found in the brain, which causes the blood vessels in the brain to contract. The narrowing of the blood vessels reverses the widening, which is thought to be one of the causes of migraines."], "DRUG URL": "https://www.medexpress.co.uk/clinics/migraine/zomig"}]